// 1--------------------------------------
// let a = prompt("cHISLO")
// if(a>0){
//     a+++1
//     alert(a)
// }
// else{
//     alert("Не целое число")
// }
// 2---------------------------------------------
// let a = prompt("cHISLO")
// if(a>0){
//     a+++1
//     alert(a)
// }
// else{
//     a---2
//     alert(a)
// }
// 3----------------------------------------------------------
// let a = +prompt("число")
// if(a > 0){
//     a +++ 1
//     console.log(a);
// }
// else if(a < 0){
//     a --- 2
//     console.log(a);
// }
// else if(a === 0){
//     console.log("10");
// }
// else{
//     console.log("Это не число");
// }
// 4+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let a = 0
// let b = 0
// let z = prompt("Число1")
// let x = prompt("Число2")
// let c = prompt("Число3")
// if(z > 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// if(x > 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// if(c > 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// console.log("Положительных чисел:",a);
// 5++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let a = 0
// let b = 0
// let z = prompt("Число1")
// let x = prompt("Число2")
// let c = prompt("Число3")
// if(z >= 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// if(x >= 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// if(c >= 0){
//     a +++ 1
// }
// else{
//     b +++ 1
// }
// console.log("Положительных чисел:",a);
// console.log("Отрицательных чисел:",b);
// 6******************************************************************************
// let a = +prompt("Число1")
// let b = +prompt("Число2")
// if(a > b){
//     console.log(a);
// }
// else{
//     console.log(b);
// }
// 7+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// let a = +prompt("Число1")
// let b = +prompt("Число2")
// if(a > b){
//     console.log(1);
// }
// else{
//     console.log(2);
// }
// 8%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
// let a = +prompt("Число1")
// let b = +prompt("Число2")
// if(a > b){
//     console.log(a,b);
// }
// else{
//     console.log(b,a);
// }

// let a = +prompt("Введите первое число: ") 
// let b = +prompt("Введите второе число: ") 
// let c = +prompt("Введите третье число: ") 
 
// let count = 0; 
 
// if (a > 0) { 
//   count++; 
// } 
 
// if (b > 0) { 
//   count++; 
// } 
 
// if (c > 0) { 
//   count++; 
// } 
 
// console.log("Количество положительных чисел: "+ count);



















































































